{"pending_diagnosis": "<b>DIAGNOSIS:</b>\n<span class=\"tg-spoiler\">Acute Intermittent Porphyria (AIP)</span>\n\n<b>THE SMOKING GUN:</b>\nWhen investigating the possibility of a metabolic derangement, a random urine sample was collected and tested via the Watson-Schwartz test. The key finding was <span class=\"tg-spoiler\">massive elevation of urinary Porphobilinogen (PBG). Furthermore, the urine collected on Day 1 was noted by the nursing staff to have turned a dark \"port-wine\" color upon standing overnight, a sign often overlooked in a busy setting</span>. The trigger was identified as the estrogen component of the new oral contraceptive and exacerbated by the initially prescribed antipsychotic (a known Porphyria inducer).\n\n<b>PATHOPHYSIOLOGY:</b>\nAcute Intermittent Porphyria is an autosomal dominant genetic disorder caused by a deficiency in the enzyme Hydroxymethylbilane Synthase (HMBS), also known as Porphobilinogen Deaminase (PBGD), the third enzyme in the heme biosynthesis pathway. This deficiency is usually latent but can be triggered (\"acute attack\") by exogenous factors such as fasting/low caloric intake, certain medications (barbiturates, sulfa drugs, hormones like estrogens), or alcohol.\n\nThe resulting accumulation of the neurotoxic precursors, delta-aminolevulinic acid (ALA) and Porphobilinogen (PBG), is responsible for the clinical syndrome. The syndrome is often summarized by the \"five P's\": Pain (severe abdominal), Polyneuropathy (motor greater than sensory), Psychosis, Pressure (hypertension), and Purple-Red urine (after oxidation). The autonomic instability (tachycardia, labile hypertension) is due to visceral and autonomic nerve damage, while the flaccid paralysis is due to axonal motor neuropathy.\n\nTreatment involves immediate cessation of the offending agent, high-dose glucose loading (to repress ALA synthase activity), and the administration of intravenous Heme Arginate (or Hematin), which rapidly downregulates the synthesis of the toxic precursors."}